{"format": "layers-model", "generatedBy": "keras v2.11.0", "convertedBy": "TensorFlow.js Converter v3.19.0", "modelTopology": {"keras_version": "2.11.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "edsr", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_2"}, "name": "input_2", "inbound_nodes": []}, {"class_name": "Lambda", "config": {"name": "lambda_4", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAACAAAAQwAAAHMMAAAAfAB0ABgAZAEbAFMAqQJOZwAAAAAA4F9AqQHa\nDkRJVjJLX1JHQl9NRUFOqQHaAXipAHIGAAAA+h9EOi9tb2RlbHMvaW1wb3J0IG51bXB5IGFzIG5w\nLnB52glub3JtYWxpemU/AAAA8wIAAAAMAQ==\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_4", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_35", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_35", "inbound_nodes": [[["lambda_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_36", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_36", "inbound_nodes": [[["conv2d_35", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_37", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_37", "inbound_nodes": [[["conv2d_36", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_17", "trainable": true, "dtype": "float32"}, "name": "add_17", "inbound_nodes": [[["conv2d_35", 0, 0, {}], ["conv2d_37", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_38", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_38", "inbound_nodes": [[["add_17", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_39", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_39", "inbound_nodes": [[["conv2d_38", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_18", "trainable": true, "dtype": "float32"}, "name": "add_18", "inbound_nodes": [[["add_17", 0, 0, {}], ["conv2d_39", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_40", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_40", "inbound_nodes": [[["add_18", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_41", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_41", "inbound_nodes": [[["conv2d_40", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_19", "trainable": true, "dtype": "float32"}, "name": "add_19", "inbound_nodes": [[["add_18", 0, 0, {}], ["conv2d_41", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_42", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_42", "inbound_nodes": [[["add_19", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_43", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_43", "inbound_nodes": [[["conv2d_42", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_20", "trainable": true, "dtype": "float32"}, "name": "add_20", "inbound_nodes": [[["add_19", 0, 0, {}], ["conv2d_43", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_44", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_44", "inbound_nodes": [[["add_20", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_45", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_45", "inbound_nodes": [[["conv2d_44", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_21", "trainable": true, "dtype": "float32"}, "name": "add_21", "inbound_nodes": [[["add_20", 0, 0, {}], ["conv2d_45", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_46", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_46", "inbound_nodes": [[["add_21", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_47", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_47", "inbound_nodes": [[["conv2d_46", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_22", "trainable": true, "dtype": "float32"}, "name": "add_22", "inbound_nodes": [[["add_21", 0, 0, {}], ["conv2d_47", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_48", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_48", "inbound_nodes": [[["add_22", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_49", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_49", "inbound_nodes": [[["conv2d_48", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_23", "trainable": true, "dtype": "float32"}, "name": "add_23", "inbound_nodes": [[["add_22", 0, 0, {}], ["conv2d_49", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_50", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_50", "inbound_nodes": [[["add_23", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_51", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_51", "inbound_nodes": [[["conv2d_50", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_24", "trainable": true, "dtype": "float32"}, "name": "add_24", "inbound_nodes": [[["add_23", 0, 0, {}], ["conv2d_51", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_52", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_52", "inbound_nodes": [[["add_24", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_53", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_53", "inbound_nodes": [[["conv2d_52", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_25", "trainable": true, "dtype": "float32"}, "name": "add_25", "inbound_nodes": [[["add_24", 0, 0, {}], ["conv2d_53", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_54", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_54", "inbound_nodes": [[["add_25", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_55", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_55", "inbound_nodes": [[["conv2d_54", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_26", "trainable": true, "dtype": "float32"}, "name": "add_26", "inbound_nodes": [[["add_25", 0, 0, {}], ["conv2d_55", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_56", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_56", "inbound_nodes": [[["add_26", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_57", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_57", "inbound_nodes": [[["conv2d_56", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_27", "trainable": true, "dtype": "float32"}, "name": "add_27", "inbound_nodes": [[["add_26", 0, 0, {}], ["conv2d_57", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_58", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_58", "inbound_nodes": [[["add_27", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_59", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_59", "inbound_nodes": [[["conv2d_58", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_28", "trainable": true, "dtype": "float32"}, "name": "add_28", "inbound_nodes": [[["add_27", 0, 0, {}], ["conv2d_59", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_60", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_60", "inbound_nodes": [[["add_28", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_61", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_61", "inbound_nodes": [[["conv2d_60", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_29", "trainable": true, "dtype": "float32"}, "name": "add_29", "inbound_nodes": [[["add_28", 0, 0, {}], ["conv2d_61", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_62", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_62", "inbound_nodes": [[["add_29", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_63", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_63", "inbound_nodes": [[["conv2d_62", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_30", "trainable": true, "dtype": "float32"}, "name": "add_30", "inbound_nodes": [[["add_29", 0, 0, {}], ["conv2d_63", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_64", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_64", "inbound_nodes": [[["add_30", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_65", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_65", "inbound_nodes": [[["conv2d_64", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_31", "trainable": true, "dtype": "float32"}, "name": "add_31", "inbound_nodes": [[["add_30", 0, 0, {}], ["conv2d_65", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_66", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_66", "inbound_nodes": [[["add_31", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_67", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_67", "inbound_nodes": [[["conv2d_66", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_32", "trainable": true, "dtype": "float32"}, "name": "add_32", "inbound_nodes": [[["add_31", 0, 0, {}], ["conv2d_67", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_68", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_68", "inbound_nodes": [[["add_32", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_33", "trainable": true, "dtype": "float32"}, "name": "add_33", "inbound_nodes": [[["conv2d_35", 0, 0, {}], ["conv2d_68", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1_scale_2", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1_scale_2", "inbound_nodes": [[["add_33", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_5", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAEAAAAEwAAAHMOAAAAdABqAaACfACIAKECUwCpAU4pA9oCdGbaAm5u\n2g5kZXB0aF90b19zcGFjZakB2gF4qQHaBXNjYWxlqQD6H0Q6L21vZGVscy9pbXBvcnQgbnVtcHkg\nYXMgbnAucHnaCDxsYW1iZGE+PAAAAHMCAAAADgA=\n", null, [2]], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_5", "inbound_nodes": [[["conv2d_1_scale_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_2_scale_2", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_2_scale_2", "inbound_nodes": [[["lambda_5", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_6", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAEAAAAEwAAAHMOAAAAdABqAaACfACIAKECUwCpAU4pA9oCdGbaAm5u\n2g5kZXB0aF90b19zcGFjZakB2gF4qQHaBXNjYWxlqQD6H0Q6L21vZGVscy9pbXBvcnQgbnVtcHkg\nYXMgbnAucHnaCDxsYW1iZGE+PAAAAHMCAAAADgA=\n", null, [2]], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_6", "inbound_nodes": [[["conv2d_2_scale_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_69", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_69", "inbound_nodes": [[["lambda_6", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_7", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAACAAAAQwAAAHMMAAAAfABkARQAdAAXAFMAqQJOZwAAAAAA4F9AqQHa\nDkRJVjJLX1JHQl9NRUFOqQHaAXipAHIGAAAA+h9EOi9tb2RlbHMvaW1wb3J0IG51bXB5IGFzIG5w\nLnB52gtkZW5vcm1hbGl6ZUMAAADzAgAAAAwB\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_7", "inbound_nodes": [[["conv2d_69", 0, 0, {}]]]}], "input_layers": [["input_2", 0, 0]], "output_layers": [["lambda_7", 0, 0]]}}, "training_config": {"loss": "mean_absolute_error", "metrics": null, "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": {"class_name": "PiecewiseConstantDecay", "config": {"boundaries": [200000], "values": [0.0001, 5e-05], "name": null}}, "decay": 0.0, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "conv2d_1_scale_2/kernel", "shape": [3, 3, 64, 256], "dtype": "float32"}, {"name": "conv2d_1_scale_2/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_2_scale_2/kernel", "shape": [3, 3, 64, 256], "dtype": "float32"}, {"name": "conv2d_2_scale_2/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_35/kernel", "shape": [3, 3, 3, 64], "dtype": "float32"}, {"name": "conv2d_35/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_36/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_36/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_37/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_37/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_38/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_38/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_39/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_39/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_40/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_40/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_41/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_41/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_42/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_42/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_43/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_43/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_44/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_44/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_45/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_45/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_46/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_46/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_47/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_47/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_48/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_48/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_49/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_49/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_50/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_50/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_51/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_51/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_52/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_52/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_53/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_53/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_54/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_54/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_55/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_55/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_56/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_56/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_57/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_57/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_58/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_58/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_59/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_59/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_60/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_60/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_61/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_61/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_62/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_62/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_63/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_63/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_64/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_64/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_65/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_65/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_66/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_66/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_67/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_67/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_68/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_68/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_69/kernel", "shape": [3, 3, 64, 3], "dtype": "float32"}, {"name": "conv2d_69/bias", "shape": [3], "dtype": "float32"}]}]}